TAMU-Robomasters/DevACustom/DevACustom.ioc
#MicroXplorer Configuration settings - do not modify
PG8.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
VP_TIM5_VS_ClockSourceINT.Mode=Internal
CAN1.NART=DISABLE
PD12.GPIO_Label=PORT_H
PI7.GPIOParameters=GPIO_Label
PG6.PinState=GPIO_PIN_RESET
PC10.GPIO_PuPd=GPIO_PULLUP
PH12.Signal=S_TIM5_CH3
FATFS._USE_LFN=2
PH12.Locked=true
PE11.GPIOParameters=GPIO_Label
PG2.GPIO_PuPd=GPIO_NOPULL
VP_TIM5_VS_ClockSourceINT.Signal=TIM5_VS_ClockSourceINT
VP_FATFS_VS_SDIO.Mode=SDIO
PG8.Signal=GPIO_Output
PG4.Signal=GPIO_Output
PG8.Locked=true
PG4.Locked=true
RCC.PLLCLKFreq_Value=168000000
PC12.Signal=SDIO_CK
PG6.GPIO_Label=LED_C
RCC.PLLQCLKFreq_Value=48000000
PG3.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
Dma.SDIO_RX.1.Direction=DMA_PERIPH_TO_MEMORY
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
RCC.RTCFreq_Value=32000
PA3.GPIOParameters=GPIO_Label
Dma.SDIO_RX.1.Priority=DMA_PRIORITY_LOW
PI6.GPIO_Label=PORT_X
TIM8.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
PD0.Locked=true
PD2.GPIOParameters=GPIO_PuPd
PG5.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
USART1.IPParameters=VirtualMode,BaudRate,Parity
SH.S_TIM4_CH4.ConfNb=1
VP_TIM8_VS_ClockSourceINT.Signal=TIM8_VS_ClockSourceINT
PG13.Signal=GPIO_Output
PA2.GPIOParameters=GPIO_Label
PG2.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
Dma.SDIO_RX.1.Instance=DMA2_Stream3
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
PH5.Signal=GPIO_Output
Dma.SDIO_TX.2.MemDataAlignment=DMA_MDATAALIGN_WORD
PD15.GPIOParameters=GPIO_Label
PF7.Signal=SPI5_SCK
VP_FATFS_VS_SDIO.Signal=FATFS_VS_SDIO
TIM2.Pulse-PWM\ Generation3\ CH3=PWM_DEFAULT_DUTY
NVIC.CAN1_TX_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
TIM8.Pulse-PWM\ Generation4\ CH4=PWM_DEFAULT_DUTY
TIM2.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3,Channel-PWM Generation4 CH4,Prescaler,Period,Pulse-PWM Generation1 CH1,Pulse-PWM Generation2 CH2,Pulse-PWM Generation3 CH3,Pulse-PWM Generation4 CH4
PG2.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
RCC.APB2TimFreq_Value=168000000
TIM4.Pulse-PWM\ Generation1\ CH1=PWM_DEFAULT_DUTY
Dma.SDIO_RX.1.FIFOMode=DMA_FIFOMODE_ENABLE
PB6.Signal=CAN2_TX
PH1/OSC_OUT.Signal=RCC_OSC_OUT
PB6.Mode=Slave
PD0.Signal=CAN1_RX
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
PE1.Signal=UART8_TX
TIM5.Pulse-PWM\ Generation1\ CH1=PWM_DEFAULT_DUTY
PH10.GPIO_Label=PORT_D
ProjectManager.ProjectBuild=false
TIM4.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
PG13.Locked=true
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PG14.Mode=Asynchronous
PG1.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.25.2
MxDb.Version=DB.5.0.60
PI7.Locked=true
PE15.Locked=true
PG6.GPIO_PuPd=GPIO_NOPULL
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=true
PI2.Locked=true
PI6.Signal=S_TIM8_CH2
PG4.GPIO_Label=LED_E
PC9.Mode=SD_4_bits_Wide_bus
SH.S_TIM4_CH2.0=TIM4_CH2,PWM Generation2 CH2
PF8.Mode=Full_Duplex_Master
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
SH.S_TIM5_CH2.ConfNb=1
TIM4.Period=PWM_RESOLUTION-1
VP_FREERTOS_VS_CMSIS_V1.Mode=CMSIS_V1
ProjectManager.HalAssertFull=false
SH.S_TIM8_CH1.ConfNb=1
RCC.MCO2PinFreq_Value=168000000
PC8.GPIOParameters=GPIO_PuPd
PH10.GPIOParameters=GPIO_Label
CAN1.Prescaler=3
Mcu.Package=UFBGA176
TIM2.Prescaler=TIM_PSC_APB1
TIM8.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
SH.S_TIM8_CH4.0=TIM8_CH4,PWM Generation4 CH4
NVIC.TimeBase=TIM7_IRQn
PG13.GPIOParameters=GPIO_Label
PG5.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PD12.Signal=S_TIM4_CH1
TIM8.Pulse-PWM\ Generation3\ CH3=PWM_DEFAULT_DUTY
Dma.USART1_RX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
NVIC.TimeBaseIP=TIM7
FREERTOS.FootprintOK=true
PC11.Mode=SD_4_bits_Wide_bus
TIM2.Pulse-PWM\ Generation2\ CH2=PWM_DEFAULT_DUTY
SPI5.CalculateBaudRate=656.25 KBits/s
PH2.Signal=GPIO_Output
PG8.GPIO_Speed=GPIO_SPEED_FREQ_LOW
RCC.APB2CLKDivider=RCC_HCLK_DIV2
NVIC.DMA2_Stream2_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
SH.S_TIM4_CH1.0=TIM4_CH1,PWM Generation1 CH1
PF14.Signal=GPIO_Output
RCC.APB1TimFreq_Value=84000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PG1.PinState=GPIO_PIN_RESET
SH.S_TIM2_CH4.ConfNb=1
NVIC.USART1_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
TIM4.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
Dma.SDIO_TX.2.FIFOThreshold=DMA_FIFO_THRESHOLD_FULL
PD15.Signal=S_TIM4_CH4
SPI5.VirtualType=VM_MASTER
TIM4.Pulse-PWM\ Generation2\ CH2=PWM_DEFAULT_DUTY
ProjectManager.CustomerFirmwarePackage=
RCC.SAI_AClocksFreq_Value=24500000
PG6.GPIO_Speed=GPIO_SPEED_FREQ_LOW
CAN1.CalculateTimeQuantum=71.42857142857143
SH.S_TIM8_CH3.0=TIM8_CH3,PWM Generation3 CH3
PH12.GPIOParameters=GPIO_Label
SH.S_TIM4_CH1.ConfNb=1
Dma.SDIO_TX.2.MemInc=DMA_MINC_ENABLE
PA0/WKUP.GPIOParameters=GPIO_Label
TIM4.Pulse-PWM\ Generation3\ CH3=PWM_DEFAULT_DUTY
ProjectManager.ProjectFileName=DevACustom.ioc
TIM5.Pulse-PWM\ Generation2\ CH2=PWM_DEFAULT_DUTY
NVIC.UART8_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
FREERTOS.Tasks01=indicatorTask,0,1024,indicatorTaskFunc,Default,NULL,Dynamic,NULL,NULL;chassisTask,0,128,chassisTaskFunc,Default,NULL,Dynamic,NULL,NULL;gimbalTask,0,128,gimbalTaskFunc,Default,NULL,Dynamic,NULL,NULL;flywheelTask,0,128,flywheelTaskFunc,Default,NULL,Dynamic,NULL,NULL;feederTask,0,128,feederTaskFunc,Default,NULL,Dynamic,NULL,NULL;rcTask,0,128,rcTaskFunc,Default,NULL,Dynamic,NULL,NULL;sensorTask,0,128,sensorTaskFunc,Default,NULL,Dynamic,NULL,NULL;canTask,0,128,canTaskFunc,Default,NULL,Dynamic,NULL,NULL;uartTask,0,128,uartTaskFunc,Default,NULL,Dynamic,NULL,NULL
TIM5.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3,Channel-PWM Generation4 CH4,Prescaler,Period,Pulse-PWM Generation1 CH1,Pulse-PWM Generation2 CH2,Pulse-PWM Generation3 CH3,Pulse-PWM Generation4 CH4
Mcu.PinsNb=67
PD2.GPIO_PuPd=GPIO_PULLUP
PG5.Locked=true
PG5.Signal=GPIO_Output
PG9.Signal=USART6_RX
PG3.Locked=true
CAN1.IPParameters=CalculateTimeQuantum,Prescaler,TXFP,BS1,BS2,ABOM,NART
PE1.Mode=Asynchronous
CAN2.IPParameters=CalculateTimeQuantum,Prescaler,BS1,BS2
PG9.Mode=Asynchronous
PD13.GPIOParameters=GPIO_Label
PD1.Signal=CAN1_TX
RCC.VCOSAIOutputFreq_ValueQ=24500000
PF14.GPIO_Label=LED_GREEN
TIM5.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
RCC.APB1CLKDivider=RCC_HCLK_DIV4
UART8.VirtualMode=Asynchronous
PC11.GPIOParameters=GPIO_PuPd
Mcu.Pin62=VP_SYS_VS_tim7
PG13.GPIO_Label=LED_LASER
Mcu.Pin63=VP_TIM2_VS_ClockSourceINT
Mcu.Pin60=VP_RNG_VS_RNG
SH.S_TIM2_CH1_ETR.ConfNb=1
Mcu.Pin61=VP_RTC_VS_RTC_Activate
Mcu.Pin66=VP_TIM8_VS_ClockSourceINT
SH.S_TIM8_CH2.0=TIM8_CH2,PWM Generation2 CH2
Mcu.Pin64=VP_TIM4_VS_ClockSourceINT
Mcu.Pin65=VP_TIM5_VS_ClockSourceINT
PG8.GPIO_PuPd=GPIO_NOPULL
PE8.Mode=Asynchronous
Mcu.Pin59=VP_FREERTOS_VS_CMSIS_V1
PG2.PinState=GPIO_PIN_RESET
Mcu.Pin57=PE15
PH11.GPIOParameters=GPIO_Label
Mcu.Pin58=VP_FATFS_VS_SDIO
PH4.Locked=true
PG5.PinState=GPIO_PIN_RESET
TIM4.IPParameters=Channel-PWM Generation4 CH4,Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3,Prescaler,Period,Pulse-PWM Generation1 CH1,Pulse-PWM Generation2 CH2,Pulse-PWM Generation3 CH3,Pulse-PWM Generation4 CH4
Mcu.Pin51=PA2
Mcu.Pin52=PE8
Mcu.Pin50=PD12
Mcu.Pin55=PF14
Mcu.Pin56=PE7
Dma.USART1_RX.0.Direction=DMA_PERIPH_TO_MEMORY
Mcu.Pin53=PE11
Mcu.Pin54=PA3
PA9.Signal=USART1_TX
PH11.GPIO_Label=PORT_C
SH.S_TIM2_CH2.ConfNb=1
SH.S_TIM5_CH3.ConfNb=1
VP_TIM8_VS_ClockSourceINT.Mode=Internal
PG7.PinState=GPIO_PIN_RESET
Dma.SDIO_TX.2.PeriphDataAlignment=DMA_PDATAALIGN_WORD
NVIC.DMA2_Stream6_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
Mcu.Pin48=PA1
Mcu.Pin49=PA0/WKUP
Dma.USART1_RX.0.PeriphInc=DMA_PINC_DISABLE
Mcu.Pin46=PD14
Mcu.Pin47=PD13
SH.S_TIM8_CH4.ConfNb=1
Dma.SDIO_RX.1.FIFOThreshold=DMA_FIFO_THRESHOLD_FULL
PG6.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
Mcu.Pin40=PF8
Mcu.Pin41=PH11
PC12.Mode=SD_4_bits_Wide_bus
SH.S_TIM8_CH1.0=TIM8_CH1,PWM Generation1 CH1
Mcu.Pin44=PG2
Mcu.Pin45=PG1
Mcu.Pin42=PH10
Mcu.Pin43=PD15
Dma.SDIO_RX.1.MemBurst=DMA_MBURST_INC4
ProjectManager.LastFirmware=true
PD1.Mode=Master
VP_SYS_VS_tim7.Signal=SYS_VS_tim7
TIM4.Pulse-PWM\ Generation4\ CH4=PWM_DEFAULT_DUTY
PI2.GPIOParameters=GPIO_Label
PI7.Signal=S_TIM8_CH3
PI6.Locked=true
PE15.Signal=GPIO_Input
Mcu.Pin37=PG4
Mcu.Pin38=PG3
Mcu.Pin35=PH12
Mcu.Pin36=PG5
PE8.Signal=UART7_TX
PG7.GPIO_Label=LED_B
Mcu.Pin39=PF9
PI2.Signal=S_TIM8_CH4
Mcu.Pin30=PH5
PA1.GPIO_Label=PORT_T
RCC.EthernetFreq_Value=168000000
PC9.GPIO_PuPd=GPIO_PULLUP
Mcu.Pin33=PF7
PA0/WKUP.GPIO_Label=PORT_S
Mcu.Pin34=PF6
Mcu.Pin31=PG7
Mcu.Pin32=PG6
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
SH.S_TIM2_CH3.ConfNb=1
PC10.GPIOParameters=GPIO_PuPd
SH.S_TIM5_CH4.ConfNb=1
TIM2.Period=PWM_RESOLUTION-1
PI0.Locked=true
PE7.Locked=true
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
PC9.GPIOParameters=GPIO_PuPd
PG1.GPIO_Speed=GPIO_SPEED_FREQ_LOW
Mcu.Pin26=PC8
Mcu.Pin27=PH1/OSC_OUT
RCC.RTCHSEDivFreq_Value=6000000
Mcu.Pin24=PH0/OSC_IN
ProjectManager.UnderRoot=false
Mcu.Pin25=PH3
Dma.SDIO_TX.2.Priority=DMA_PRIORITY_LOW
TIM8.Period=PWM_RESOLUTION-1
Mcu.Pin28=PH4
PC8.Mode=SD_4_bits_Wide_bus
Mcu.Pin29=PG8
PC8.GPIO_PuPd=GPIO_PULLUP
TIM5.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
PD14.GPIOParameters=GPIO_Label
PB5.Signal=CAN2_RX
Mcu.Pin22=PH2
PG7.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
Mcu.Pin23=PC9
Mcu.Pin20=PI0
Mcu.Pin21=PA9
PA3.Locked=true
NVIC.ForceEnableDMAVector=true
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=6
PD15.Locked=true
SH.S_TIM2_CH1_ETR.0=TIM2_CH1,PWM Generation1 CH1
TIM5.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
Dma.SDIO_TX.2.MemBurst=DMA_MBURST_INC4
ProjectManager.HeapSize=0x2000
Mcu.Pin15=PI5
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.Pin16=PG9
PH5.Locked=true
Dma.SDIO_RX.1.MemInc=DMA_MINC_ENABLE
Mcu.Pin13=PI7
UART7.IPParameters=VirtualMode
Mcu.Pin14=PI6
Mcu.Pin19=PD2
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PD1
PF9.Signal=SPI5_MOSI
Mcu.Pin18=PI2
VP_TIM4_VS_ClockSourceINT.Mode=Internal
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PC11
Mcu.Pin12=PC10
Mcu.Pin10=PD0
Dma.SDIO_TX.2.PeriphInc=DMA_PINC_DISABLE
TIM2.Pulse-PWM\ Generation4\ CH4=PWM_DEFAULT_DUTY
PG3.GPIO_Label=LED_F
PD2.Signal=SDIO_CMD
PG5.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PD1.Locked=true
SPI5.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
PH2.GPIO_Label=POWER1_CTRL
PG7.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
NVIC.CAN1_RX0_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
Mcu.Family=STM32F4
ProjectManager.MainLocation=Core/Src
SH.S_TIM4_CH2.ConfNb=1
RCC.CortexFreq_Value=168000000
Dma.SDIO_RX.1.PeriphDataAlignment=DMA_PDATAALIGN_WORD
PG6.Signal=GPIO_Output
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F427IIHx
PH10.Signal=S_TIM5_CH1
UART8.IPParameters=VirtualMode
PG2.Signal=GPIO_Output
PE11.GPIO_Label=LED_RED
USART1.BaudRate=100000
PG6.Locked=true
PC10.Signal=SDIO_D2
PG2.Locked=true
TIM8.Pulse-PWM\ Generation1\ CH1=PWM_DEFAULT_DUTY
Dma.SDIO_RX.1.Mode=DMA_PFCTRL
Dma.SDIO_RX.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,FIFOThreshold,MemBurst,PeriphBurst
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_CAN1_Init-CAN1-false-HAL-true,5-MX_TIM2_Init-TIM2-false-HAL-true,6-MX_TIM4_Init-TIM4-false-HAL-true,7-MX_TIM5_Init-TIM5-false-HAL-true,8-MX_TIM8_Init-TIM8-false-HAL-true,9-MX_RNG_Init-RNG-false-HAL-true,10-MX_RTC_Init-RTC-false-HAL-true,11-MX_USART6_UART_Init-USART6-false-HAL-true,12-MX_CAN2_Init-CAN2-false-HAL-true,13-MX_USART1_UART_Init-USART1-false-HAL-true,14-MX_UART7_Init-UART7-false-HAL-true,15-MX_UART8_Init-UART8-false-HAL-true,16-MX_SDIO_SD_Init-SDIO-false-HAL-true,17-MX_FATFS_Init-FATFS-false-HAL-false
SH.S_TIM5_CH2.0=TIM5_CH2,PWM Generation2 CH2
PH10.Locked=true
PA0/WKUP.Signal=S_TIM2_CH1_ETR
TIM5.Pulse-PWM\ Generation4\ CH4=PWM_DEFAULT_DUTY
PH5.GPIO_Label=POWER4_CTRL
PI5.GPIO_Label=PORT_W
TIM2.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
PG5.GPIO_Label=LED_D
PI0.GPIOParameters=GPIO_Label
PH5.GPIOParameters=GPIO_Label
ProjectManager.StackSize=0x4000
PG3.GPIO_PuPd=GPIO_NOPULL
PG2.GPIO_Speed=GPIO_SPEED_FREQ_LOW
RCC.SAI_BClocksFreq_Value=24500000
Dma.SDIO_TX.2.Mode=DMA_PFCTRL
PD13.Signal=S_TIM4_CH2
Mcu.IP4=FREERTOS
Mcu.IP5=NVIC
RCC.FCLKCortexFreq_Value=168000000
PD13.Locked=true
Mcu.IP2=DMA
Mcu.IP3=FATFS
PC11.GPIO_PuPd=GPIO_PULLUP
Mcu.IP0=CAN1
Mcu.IP1=CAN2
PH4.GPIOParameters=GPIO_Label
Mcu.UserConstants=APB1_TIMER_CLOCKS,84000000;PWM_DEFAULT_DUTY,5000;PWM_FREQUENCE,50;PWM_RESOLUTION,10000;TIM_PSC_APB1,((APB1_TIMER_CLOCKS/PWM_FREQUENCE)/PWM_RESOLUTION -1);APB2_TIMER_CLOCKS,168000000;TIM_PSC_APB2,((APB2_TIMER_CLOCKS/PWM_FREQUENCE)/PWM_RESOLUTION -1)
PH3.Locked=true
Mcu.ThirdPartyNb=0
PH0/OSC_IN.Mode=HSE-External-Oscillator
PG3.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
RCC.HCLKFreq_Value=168000000
TIM8.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
Mcu.IPNb=20
RCC.I2SClocksFreq_Value=192000000
ProjectManager.PreviousToolchain=
RCC.VcooutputI2S=192000000
PG8.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PA0/WKUP.Locked=true
SH.S_TIM5_CH3.0=TIM5_CH3,PWM Generation3 CH3
Mcu.Pin6=PA14
PG5.GPIO_PuPd=GPIO_NOPULL
Mcu.Pin7=PA13
Mcu.Pin8=PB7
Mcu.Pin9=PB6
RCC.VCOSAIOutputFreq_Value=98000000
FREERTOS.IPParameters=Tasks01,FootprintOK
RCC.AHBFreq_Value=168000000
Dma.USART1_RX.0.Priority=DMA_PRIORITY_LOW
Mcu.Pin0=PE1
Mcu.Pin1=PE0
TIM8.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3,Channel-PWM Generation4 CH4,Prescaler,Period,Pulse-PWM Generation1 CH1,Pulse-PWM Generation2 CH2,Pulse-PWM Generation3 CH3,Pulse-PWM Generation4 CH4
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PB5
Mcu.Pin3=PG14
Mcu.Pin4=PG13
Mcu.Pin5=PC12
RCC.HSE_VALUE=12000000
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.IP10=SPI5
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
Mcu.IP12=TIM2
Mcu.IP11=SYS
Mcu.IP18=USART1
Mcu.IP17=UART8
Mcu.IP19=USART6
Mcu.IP14=TIM5
PF9.Mode=Full_Duplex_Master
Mcu.IP13=TIM4
Mcu.IP16=UART7
Mcu.IP15=TIM8
RCC.VCOInputFreq_Value=2000000
PG4.GPIO_Speed=GPIO_SPEED_FREQ_LOW
TIM5.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
PI5.Locked=true
PI5.Signal=S_TIM8_CH1
PA14.Mode=Serial_Wire
PE8.Locked=true
CAN2.Prescaler=3
PI0.Signal=S_TIM5_CH4
TIM5.Pulse-PWM\ Generation3\ CH3=PWM_DEFAULT_DUTY
PB5.Mode=Slave
File.Version=6
Dma.SDIO_TX.2.Direction=DMA_MEMORY_TO_PERIPH
PH3.GPIOParameters=GPIO_Label
PB7.Signal=USART1_RX
PG7.GPIO_PuPd=GPIO_NOPULL
TIM2.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
Dma.USART1_RX.0.MemInc=DMA_MINC_ENABLE
PH1/OSC_OUT.Mode=HSE-External-Oscillator
Dma.RequestsNb=3
ProjectManager.ProjectName=DevACustom
SH.S_TIM8_CH3.ConfNb=1
PG6.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PD13.GPIO_Label=PORT_G
PG4.PinState=GPIO_PIN_RESET
SPI5.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_128
TIM8.Pulse-PWM\ Generation2\ CH2=PWM_DEFAULT_DUTY
CAN2.BS1=CAN_BS1_9TQ
CAN2.BS2=CAN_BS2_4TQ
USART6.VirtualMode=VM_ASYNC
Dma.SDIO_TX.2.PeriphBurst=DMA_PBURST_INC4
ProjectManager.ToolChainLocation=
PG1.GPIO_PuPd=GPIO_NOPULL
PD14.Locked=true
PA2.GPIO_Label=PORT_U
RCC.LSI_VALUE=32000
TIM8.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
PF8.Signal=SPI5_MISO
Dma.SDIO_RX.1.PeriphBurst=DMA_PBURST_INC4
PI0.GPIO_Label=PORT_A
PH3.GPIO_Label=POWER2_CTRL
TIM8.Prescaler=TIM_PSC_APB1
Dma.USART1_RX.0.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.SDIO_TX.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,FIFOThreshold,MemBurst,PeriphBurst
PG8.PinState=GPIO_PIN_RESET
Dma.Request2=SDIO_TX
Dma.Request1=SDIO_RX
SH.S_TIM5_CH1.0=TIM5_CH1,PWM Generation1 CH1
Dma.USART1_RX.0.Mode=DMA_CIRCULAR
PE7.Signal=UART7_RX
PI2.GPIO_Label=PORT_Z
Dma.Request0=USART1_RX
Dma.USART1_RX.0.Instance=DMA2_Stream2
NVIC.TIM7_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
PG2.GPIO_Label=LED_G
PA3.Signal=S_TIM2_CH4
PA2.Locked=true
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
TIM4.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
TIM2.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
PG7.Locked=true
PD15.GPIO_Label=PORT_E
PG7.Signal=GPIO_Output
Dma.USART1_RX.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
CAN1.TXFP=DISABLE
PH12.GPIO_Label=PORT_B
PG4.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PH11.Signal=S_TIM5_CH2
ProjectManager.NoMain=false
PG3.Signal=GPIO_Output
USART6.IPParameters=VirtualMode
SH.S_TIM4_CH4.0=TIM4_CH4,PWM Generation4 CH4
PG1.Signal=GPIO_Output
VP_SYS_VS_tim7.Mode=TIM7
PG1.Locked=true
PC11.Signal=SDIO_D3
PC8.Signal=SDIO_D0
PC10.Mode=SD_4_bits_Wide_bus
ProjectManager.DefaultFWLocation=true
Dma.SDIO_TX.2.Instance=DMA2_Stream6
ProjectManager.DeletePrevious=true
UART7.VirtualMode=Asynchronous
VP_RNG_VS_RNG.Mode=RNG_Activate
SPI5.Mode=SPI_MODE_MASTER
PinOutPanel.CurrentBGAView=Top
NVIC.SDIO_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
RCC.FamilyName=M
TIM2.Pulse-PWM\ Generation1\ CH1=PWM_DEFAULT_DUTY
Dma.SDIO_RX.1.PeriphInc=DMA_PINC_DISABLE
NVIC.USART6_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
PE15.GPIOParameters=GPIO_Label
PD12.Locked=true
PG8.GPIO_Label=LED_A
FATFS.IPParameters=_MAX_SS,_USE_LFN,_FS_EXFAT
PA13.Signal=SYS_JTMS-SWDIO
PF7.Mode=Full_Duplex_Master
VP_FREERTOS_VS_CMSIS_V1.Signal=FREERTOS_VS_CMSIS_V1
SH.S_TIM2_CH2.0=TIM2_CH2,PWM Generation2 CH2
PA9.Mode=Asynchronous
PE15.GPIO_Label=SD_EXTI
