TAMU-Robomasters/DevACustom/DevACustom.ioc
PH4.Signal=GPIO_Output
CAN1.BS2=CAN_BS2_4TQ
PF6.Signal=GPIO_Output
PD12.GPIOParameters=GPIO_Label
VP_TIM4_VS_ClockSourceINT.Signal=TIM4_VS_ClockSourceINT
CAN1.BS1=CAN_BS1_9TQ
ProjectManager.TargetToolchain=MDK-ARM V5
PF6.Locked=true
SH.S_TIM4_CH3.0=TIM4_CH3,PWM Generation3 CH3
VP_RNG_VS_RNG.Signal=RNG_VS_RNG
USART1.Parity=PARITY_EVEN
RCC.VcooutputI2SQ=192000000
PG1.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PI5.GPIOParameters=GPIO_Label
PH2.GPIOParameters=GPIO_Label
PH11.Locked=true
NVIC.DMA2_Stream3_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
TIM4.Prescaler=TIM_PSC_APB1
PE11.Signal=GPIO_Output
RCC.LSE_VALUE=32768
PA1.Signal=S_TIM2_CH2
CAN1.ABOM=ENABLE
Dma.SDIO_RX.1.MemDataAlignment=DMA_MDATAALIGN_WORD
SH.S_TIM4_CH3.ConfNb=1
RCC.VCOI2SOutputFreq_Value=384000000
PD2.Mode=SD_4_bits_Wide_bus
PG14.Signal=USART6_TX
board=custom
RCC.VCOOutputFreq_Value=336000000
PG1.GPIO_Label=LED_H
PF14.GPIOParameters=GPIO_Label
PH4.GPIO_Label=POWER3_CTRL
PH0/OSC_IN.Signal=RCC_OSC_IN
PG3.PinState=GPIO_PIN_RESET
TIM4.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
PG7.GPIO_Speed=GPIO_SPEED_FREQ_LOW
RCC.APB2Freq_Value=84000000
FATFS._FS_EXFAT=1
MxCube.Version=5.6.1
PG4.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
VP_TIM2_VS_ClockSourceINT.Mode=Internal
SH.S_TIM2_CH3.0=TIM2_CH3,PWM Generation3 CH3
CAN2.CalculateTimeQuantum=71.42857142857143
TIM2.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
Dma.USART1_RX.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
PI7.GPIO_Label=PORT_Y
SH.S_TIM5_CH4.0=TIM5_CH4,PWM Generation4 CH4
PD14.GPIO_Label=PORT_F
PF14.Locked=true
RCC.IPParameters=48MHZClocksFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LSE_VALUE,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLM,PLLN,PLLQ,PLLQCLKFreq_Value,PLLSourceVirtual,RTCFreq_Value,RTCHSEDivFreq_Value,SAI_AClocksFreq_Value,SAI_BClocksFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value,VCOSAIOutputFreq_ValueQ,VcooutputI2S,VcooutputI2SQ
PE11.Locked=true
ProjectManager.AskForMigrate=true
PE0.Signal=UART8_RX
Mcu.Name=STM32F427I(G-I)Hx
PD0.Mode=Master
PA2.Signal=S_TIM2_CH3
FATFS._MAX_SS=4096
Mcu.IP8=RTC
Mcu.IP9=SDIO
PD14.Signal=S_TIM4_CH3
Mcu.IP6=RCC
Mcu.IP7=RNG
ProjectManager.CoupleFile=true
RCC.48MHZClocksFreq_Value=48000000
RCC.SYSCLKFreq_VALUE=168000000
PE7.Mode=Asynchronous
PA1.Locked=true
KeepUserPlacement=false
TIM5.Prescaler=TIM_PSC_APB1
PB7.Mode=Asynchronous
PA14.Signal=SYS_JTCK-SWCLK
PG3.GPIO_Speed=GPIO_SPEED_FREQ_LOW
Dma.SDIO_TX.2.FIFOMode=DMA_FIFOMODE_ENABLE
SH.S_TIM2_CH4.0=TIM2_CH4,PWM Generation4 CH4
PG4.GPIO_PuPd=GPIO_NOPULL
RCC.HSI_VALUE=16000000
PI6.GPIOParameters=GPIO_Label
PH2.Locked=true
RCC.PLLQ=7
PH3.Signal=GPIO_Output
RCC.PLLM=6
RCC.PLLN=168
TIM5.Period=PWM_RESOLUTION-1
PC9.Signal=SDIO_D1
RCC.APB1Freq_Value=42000000
ProjectManager.DeviceId=STM32F427IIHx
SH.S_TIM8_CH2.ConfNb=1
PE0.Mode=Asynchronous
ProjectManager.LibraryCopy=1
SH.S_TIM5_CH1.ConfNb=1
SPI5.Direction=SPI_DIRECTION_2LINES
PA3.GPIO_Label=PORT_V
NVIC.UART7_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
